Repository: Ibrokihimbek/flutter-competition
Catalog: lib/l10n/intl_*.arb
Languages: uz

# takeCharge
source: Get a power bank
uz: Quvvatlagichni oling

# chooseVerificationMethod
source: Choose a verification method
uz: Ro'yxatdan o'tish usulini tanlang

source: Phone
uz: Telefon

# byLoggingInRegisteringYouAcceptTheTerms
source: By logging in or registering, you accept the terms of the
uz: Tizimga kirish yoki ro'yxatdan o'tish orqali siz

# userAgreementsAndSecurity
source: user agreement and security
uz: foydalanuvchi shartnomasi va xavfsizlik shartlarini qabul qilasiz

source: Support
uz: Qo'llab-quvvatlash

source: Filter
uz: Filtr

# closeUp
source: Close
uz: Yopish

# getPowerBank
source: Get a power bank
uz: Quvvatlagichni olish

source: Return power bank
uz: Quvvatlagichni qaytarish

source: Reset filter
uz: Filterni tozalash

source: Profile
uz: Profil

source: Login to profile
uz: Profilga kirish

source: Rental Packages
uz: Ijara paketlari

source: History of orders
uz: Buyurtmalar tarixi

source: My cards
uz: Mening kartalarim

source: Rates
uz: Tariflar

source: Pricing
uz: Narxlash

source: Documentation
uz: Hujjatlar

source: Language
uz: Til

source: About the application
uz: Ilova haqida

source: Join us
uz: Bizga qo'shiling

source: Points
uz: Ballar

source: Confirm
uz: Tasdiqlang

# weWillSendVerificationCodeToYourNumber
source: We will send a verification code to your number
uz: Raqamingizga tasdiqlash kodini yuboramiz

# weHaveSentConfirmationCodeToYourPhoneNumber
source: We have sent a confirmation code to your phone number
uz: Telefon raqamingizga tasdiqlash kodini yubordik

source: Wrong code entered
uz: Noto'g'ri kod kiritildi

source: Send again
uz: Qayta jo'natish

# continueButton
source: Continue
uz: Davom etish

source: Sign out
uz: Tizimdan chiqish

source: Personal data
uz: Shaxsiy ma'lumotlar

source: score
uz: bal

source: Change
uz: O'zgartirish

source: Delete account
uz: Hisobni o'chirish

source: All your rental data and accrued points will be permanently deleted.
uz: Barcha ijara maʼlumotlaringiz va toʻplangan ballaringiz butunlay oʻchirib tashlanadi.

source: Delete
uz: O'chirish

source: Cancel
uz: Bekor qilish

source: Enter your name
uz: Ismingizni kiriting

source: Name
uz: Ism

source: Phone number
uz: Telefon raqam

source: Enter age
uz: Yoshni kiriting

source: Date of birth
uz: Tug'ilgan kun

source: Gender
uz: Jins

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Save
uz: Saqlash

source: Profitable offer
uz: Ajoyib narxlarda

source: at favorable prices!
uz: ajoyib takliflar!

source: How it works
uz: Bu qanday ishlaydi

# chooseRentalPackages
source: Choose a Rental Packages
uz: Ijara paketini tanlang

source: Standard
uz: Standart

# forWeek
source: For a week
uz: Bir haftaga

source: instead of
uz: o'rniga

source: days
uz: kunlar

source: More
uz: Ko'proq

source: Rent
uz: Ijara

source: during the week
uz: hafta davomida

source: A few more bonuses
uz: Yana bir nechta bonuslar

source: sum
uz: so'm

source: Buy
uz: Sotib olish

source: Choose payment method
uz: To'lov usulini tanlang

source: Payment
uz: To'lov

source: Subscribed
uz: Obuna boʻlgan

# youHaveSignedUpForOneTimeRentalPackagesThatHasCertainBenefits
source: You have signed up for a one-time Rental Packages that has certain benefits.
uz: Siz ma'lum imtiyozlarga ega bo'lgan bir martalik Ijara paketi uchun ro'yxatdan o'tgansiz.

source: To main menu
uz: Asosiy menyuga

source: Used
uz: Ishlatilgan

source: Rental start
uz: Ijara boshlanishi

source: Rental amount
uz: Ijara miqdori

source: Powerbank ID
uz: Quvvatlagich identifikatori

# detail
source: In detail
uz: Batafsil

source: Debt payable
uz: To'lanadigan qarz

source: End of lease
uz: Ijara muddati

source: Payment method
uz: To'lov usuli

source: This is where your cards and points are stored.
uz: Bu sizning kartalaringiz va ballaringiz saqlanadigan joy.

source: Delete card?
uz: Kartani o'chirish?

source: Add card
uz: Karta qo'shish

# linkingNewCard
source: Linking a new card
uz: Yangi kartani ulash

# yourCardDetailsAreSecurelyProtected
source: Your card details are securely protected. You won't need to re-enter your details for future payments.
uz: Sizning kartangiz ma'lumotlari ishonchli himoyalangan. Kelgusi toʻlovlar uchun maʼlumotlarni qayta kiritishingiz shart emas.

source: Card number
uz: Karta raqami

# monthYear
source: Expire date
uz: Amal qilish muddati

source: Bind
uz: Bog'lamoq

source: Confirmation
uz: Tasdiqlash

# uzb
source: Uzbek
uz: O'zbekcha

source: User Agreements
uz: Foydalanuvchi shartnomalari

source: Data processing
uz: Ma'lumotlarni qayta ishlash

source: FAQ
uz: Qwatt haqida savollar

# rus
source: Russian
uz: Ruscha

# eng
source: English
uz: Inglizcha

source: Russian
uz: Rossiya

source: Uzbekistan
uz: O'zbekiston

source: Email
uz: Elektron pochta

source: Website
uz: Veb sayt

source: For cooperation
uz: Hamkorlik uchun

source: Developed by the company
uz: Kompaniya tomonidan ishlab chiqilgan

source: Application version
uz: Ilova versiyasi

source: take
uz: olish

# powerBankReturn
source: return
uz: qaytish

source: Price
uz: Narxi

source: First hour
uz: Birinchi soat

source: hours
uz: soat

source: day
uz: kun

source: This is not vending
uz: Bu savdo emas

# thereforeWeCannotIssuePowerBank
source: Therefore, we cannot issue a power bank. Checking if everything is correct: our name should be on the counter
uz: Shuning uchun biz quvvat bankini chiqara olmaymiz. Har bir narsa to'g'ri yoki yo'qligini tekshirish: bizning ismimiz peshtaxtada bo'lishi kerak

source: Fine
uz: Yaxshi

source: Scan the QR code at
uz: QR kodini skanerlang

source: Can't scan QR code?
uz: QR kodni skanerlab bo‘lmadimi?

# enterCodeBelowTheQrCode
source: Enter the code below the QR code
uz: QR kod ostidagi kodni kiriting

# enterDigitCodeThatIsWrittenOnStation
source: Enter the 6-digit code that is written on the station.
uz: Stansiyada yozilgan 6 xonali kodni kiriting.

source: Scan QR code
uz: QR kodini skanerlang

# rents
source: Rent
uz: Ijara

source: Station Information
uz: Stansiya haqida ma'lumot

source: Cabinet ID
uz: Kabinet identifikatori

source: Status
uz: Holat

source: Online
uz: Onlayn

source: Offline
uz: Oflayn

source: Payment Information
uz: To'lov ma'lumotlari

# whatHappensIfUouDoNotReturnBank
source: What happens if you do not return the bank?
uz: Agar siz bankni qaytarib bermasangiz nima bo'ladi?

source: Rent now
uz: Hozir ijaraga oling

source: Charge and enjoy using.
uz: Zaryad qiling va foydalanishdan zavqlaning.

source: Powerbank rented
uz: Quvvatlagich ijaraga olingan

# errorHasOccurred
source: An error has occurred
uz: Xatolik yuz berdi

# youMustHaveAtLeastInYourAccountForRent
source: You must have at least 10,000 UZS in your account for rent.
uz: Ijara uchun hisobingizda kamida 10 000 so‘m bo‘lishi kerak.

source: route
uz: marshrut

source: meter
uz: metr

# expirationDateIsIncorrect
source: The expiration date is incorrect
uz: Yaroqlilik mudati not'g'ri

source: There is nothing here yet
uz: Bu erda hali hech narsa yo'q

source: Apply
uz: Filtirlash

source: Place of rent
uz: Ijara joyi

# howToRentPowerBank
source: How to rent a power bank?
uz: Ijaraga qanday olish mumkin?

source: Lacks
uz: Yetarli emas

# opening
source: To open with
uz: Ochish

# youHaveChargerInUse
source: You have a charger in use!
uz: Sizda foydalanilayotgan quvvatlagich bor!

source: Working hours
uz: Ish vaqti

# open
source: Open from
uz: Ochilish vaqti

# close
source: to
uz: gacha

source: Go out
uz: Chiqish

source: Disabled
uz: O'chirilgan

source: Sorry
uz: Kechirasiz

# stationStatusAbnormal
source: The cabinet is in abnormal state and cannot be rented
uz: Avtomat ishdan chiqqan. Ijaraga olish mumkin emas

source: Cancellation
uz: Bekor qilish

source: station
uz: stantsiya

# expireDate
source: mm/yy
uz: oo/yy

# youAreNotOnline
source: You're not online
uz: Siz onlayn emassiz

# makeSureYourPhoneIsConnectedInternet
source: Make sure your phone is connected to the internet.
uz: Telefoningiz internetga ulanganligiga ishonch hosil qiling.

source: Done
uz: Tanlandi

source: You have debt
uz: Sizda qarzdorlik mavjud

# areYouSureYouWantLogOut
source: Are you sure you want to log out?
uz: Accountdan rostdan ham chiqmoqchimisiz?

# weSelectChargedPowerBank
source: We select a charged power bank
uz: Biz zaryadlangan quvvat bankini tanlaymiz

# yourAccountBeenBlocked
source: Contact the Qwat call center if your account has been blocked for some reason!
uz: Malum bir sabablarga ko'ra sizning akkountingiz bloklangan Qwat call markazi bilan bog'laning!

# openAppSettings
source: Tap settings button > Settings > Permissions, and turn Location on.
uz: Sozlamalar tugmasiтш ищыштп > Sozlamalar > Ruxsatlar ga teging va Joylashuvni aniqlashni yoqing.

source: Settings
uz: Sozlamalar

# locationSettings
source: Please enable your GPS to access location-based features.
uz: Iltimos, kirish uchun GPS-ni yoqing joylashuvga asoslangan xususiyatlar.

source: Bonuses
uz: Bonuslar

source: Share a link and get bonuses
uz: Havolani ulashing va bonuslarga ega bo'ling

source: Enter promo code and get bonuses
uz: Promo-kodni kiriting va bonuslarni oling

source: Promo code
uz: Promo kod

source: Active
uz: Faollashtirish

# installAppAndGetBonuses
source: Install the app through the link and get bonuses
uz: Havola orqali ilovani o'rnatib oling va bonuslarga ega bo'ling

# notEnoughPointsToCreateLease
source: Not enough points to create a lease
uz: Quvvatlagichni olish uchun ballar yetarli emas

# inviteYourFriendsToAppAndEarnPoints
source: Invite your friends to the app and earn points
uz: Do'stlaringizni ilovaga taklif qiling va ballarni qo'lga kiriting

# selectCardForSubsequentDebiting
source: Select a card for subsequent debiting
uz: Ballar tugagandan so'ng pul yechib olinishi uchun kartalaringizdan birini tanlang

# youHaveSuccessfullyActivatedPromoCode
source: You have successfully activated the promo code
uz: Siz promo-kodni muvaffaqiyatli faollashtirdingiz

source: This promo code does not exist or has already been used
uz: Ushbu promo-kod mavjud emas yoki allaqachon ishlatilgan

source: year
uz: yil
